bench/mcpeval.yaml
name: Mason MCP Server Benchmark
description: Evaluate Mason's context engineering tools across different task types

mcp:
  servers:
    mason:
      transport: stdio
      command: node
      args:
      - ../dist/bin/mason-mcp.js

provider: anthropic
model: claude-sonnet-4-20250514

judge:
  provider: anthropic
  model: claude-sonnet-4-20250514
  min_score: 0.8

execution:
  max_concurrency: 1

reporting:
  formats:
  - json
  - markdown
  output_dir: ./test-reports

agents:
  definitions:
  - name: default
    instruction: You are a helpful assistant that can use MCP servers effectively.
    server_names:
    - mason
    provider: anthropic
default_agent: default